# TagHeadPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..TagHeadPosition Property
MultiReferenceAnnotationOptions Class See Also
---
The position for the tag's head.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ TagHeadPosition { get; set; }
```

Visual Basic
---
```text
Public Property TagHeadPosition As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace